src/main/java/pl/edu/pw/performanceanalyser/vanilla/kafka/results_scalability.txt
Testing scalability: 10 producers, 10 consumers, 1024B message size.
Running producer test with 10 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99403.578529 records/sec (97.07 MB/sec), 32.89 ms avg latency, 142.00 ms max latency, 1 ms 50th, 103 ms 95th, 104 ms 99th, 105 ms 99.9th.

Running consumer test with 10 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:35:12:742, 2025-01-13 20:35:13:093, 98.0859, 279.4471, 100440, 286153.8462, 144, 207, 473.8451, 485217.3913

Testing scalability: 10 producers, 10 consumers, 1048575B message size.
Running producer test with 10 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 364.963504 records/sec (364.96 MB/sec), 1.82 ms avg latency, 130.00 ms max latency, 2 ms 50th, 3 ms 95th, 5 ms 99th, 130 ms 99.9th.

Running consumer test with 10 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:35:18:025, 2025-01-13 20:35:18:196, 1.4600, 8.5378, 1495, 8742.6901, 146, 25, 58.3984, 59800.0000

Testing scalability: 10 producers, 20 consumers, 1024B message size.
Running producer test with 10 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99304.865938 records/sec (96.98 MB/sec), 32.20 ms avg latency, 139.00 ms max latency, 4 ms 50th, 93 ms 95th, 96 ms 99th, 97 ms 99.9th.

Running consumer test with 20 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:35:21:514, 2025-01-13 20:35:22:776, 1097.0742, 869.3140, 100405, 79560.2219, 170, 1092, 1004.6467, 91945.9707

Testing scalability: 10 producers, 20 consumers, 1048575B message size.
Running producer test with 10 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 366.166239 records/sec (366.17 MB/sec), 2.12 ms avg latency, 130.00 ms max latency, 2 ms 50th, 4 ms 95th, 13 ms 99th, 130 ms 99.9th.

Running consumer test with 20 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:35:27:727, 2025-01-13 20:35:27:899, 1.4600, 8.4881, 1495, 8691.8605, 146, 26, 56.1523, 57500.0000

Testing scalability: 10 producers, 30 consumers, 1024B message size.
Running producer test with 10 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 46104.195482 records/sec (45.02 MB/sec), 353.87 ms avg latency, 655.00 ms max latency, 276 ms 50th, 623 ms 95th, 652 ms 99th, 654 ms 99.9th.

Running consumer test with 30 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:35:32:271, 2025-01-13 20:35:33:781, 1096.6885, 726.2838, 100010, 66231.7881, 144, 1366, 802.8466, 73213.7628

Testing scalability: 10 producers, 30 consumers, 1048575B message size.
Running producer test with 10 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 358.680057 records/sec (358.68 MB/sec), 2.23 ms avg latency, 136.00 ms max latency, 2 ms 50th, 4 ms 95th, 21 ms 99th, 136 ms 99.9th.

Running consumer test with 30 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:35:38:812, 2025-01-13 20:35:38:978, 0.9766, 5.8829, 1000, 6024.0964, 144, 22, 44.3892, 45454.5455

Testing scalability: 10 producers, 40 consumers, 1024B message size.
Running producer test with 10 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99304.865938 records/sec (96.98 MB/sec), 40.94 ms avg latency, 134.00 ms max latency, 17 ms 50th, 105 ms 95th, 111 ms 99th, 112 ms 99.9th.

Running consumer test with 40 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:35:42:217, 2025-01-13 20:35:44:135, 1096.6787, 571.7824, 100000, 52137.6434, 147, 1771, 619.2427, 56465.2739

Testing scalability: 10 producers, 40 consumers, 1048575B message size.
Running producer test with 10 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 366.166239 records/sec (366.17 MB/sec), 1.94 ms avg latency, 132.00 ms max latency, 2 ms 50th, 3 ms 95th, 11 ms 99th, 132 ms 99.9th.

Running consumer test with 40 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:35:49:138, 2025-01-13 20:35:49:307, 0.9766, 5.7785, 1000, 5917.1598, 147, 22, 44.3892, 45454.5455

Testing scalability: 10 producers, 50 consumers, 1024B message size.
Running producer test with 10 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99403.578529 records/sec (97.07 MB/sec), 29.34 ms avg latency, 136.00 ms max latency, 1 ms 50th, 91 ms 95th, 93 ms 99th, 94 ms 99.9th.

Running consumer test with 50 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:35:52:566, 2025-01-13 20:35:53:740, 1096.6787, 934.1386, 100000, 85178.8756, 141, 1033, 1061.6445, 96805.4211

Testing scalability: 10 producers, 50 consumers, 1048575B message size.
Running producer test with 10 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 366.300366 records/sec (366.30 MB/sec), 1.87 ms avg latency, 128.00 ms max latency, 2 ms 50th, 3 ms 95th, 8 ms 99th, 128 ms 99.9th.

Running consumer test with 50 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:35:58:704, 2025-01-13 20:35:58:872, 0.9766, 5.8129, 1000, 5952.3810, 146, 22, 44.3892, 45454.5455

Testing scalability: 20 producers, 10 consumers, 1024B message size.
Running producer test with 20 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99206.349206 records/sec (96.88 MB/sec), 32.62 ms avg latency, 133.00 ms max latency, 9 ms 50th, 87 ms 95th, 89 ms 99th, 90 ms 99.9th.

Running consumer test with 10 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:36:02:195, 2025-01-13 20:36:03:359, 1096.6787, 942.1639, 100000, 85910.6529, 142, 1022, 1073.0712, 97847.3581

Testing scalability: 20 producers, 10 consumers, 1048575B message size.
Running producer test with 20 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 364.963504 records/sec (364.96 MB/sec), 2.10 ms avg latency, 128.00 ms max latency, 2 ms 50th, 4 ms 95th, 15 ms 99th, 128 ms 99.9th.

Running consumer test with 10 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:36:08:325, 2025-01-13 20:36:08:493, 0.9766, 5.8129, 1000, 5952.3810, 146, 22, 44.3892, 45454.5455

Testing scalability: 20 producers, 20 consumers, 1024B message size.
Running producer test with 20 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 83472.454090 records/sec (81.52 MB/sec), 126.39 ms avg latency, 555.00 ms max latency, 134 ms 50th, 151 ms 95th, 152 ms 99th, 153 ms 99.9th.

Running consumer test with 20 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:36:12:478, 2025-01-13 20:36:13:710, 1096.6787, 890.1613, 100000, 81168.8312, 145, 1087, 1008.9041, 91996.3201

Testing scalability: 20 producers, 20 consumers, 1048575B message size.
Running producer test with 20 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 364.431487 records/sec (364.43 MB/sec), 2.04 ms avg latency, 134.00 ms max latency, 2 ms 50th, 4 ms 95th, 9 ms 99th, 134 ms 99.9th.

Running consumer test with 20 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:36:18:696, 2025-01-13 20:36:18:865, 0.9766, 5.7785, 1000, 5917.1598, 147, 22, 44.3892, 45454.5455

Testing scalability: 20 producers, 30 consumers, 1024B message size.
Running producer test with 20 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99403.578529 records/sec (97.07 MB/sec), 38.01 ms avg latency, 138.00 ms max latency, 26 ms 50th, 100 ms 95th, 102 ms 99th, 102 ms 99.9th.

Running consumer test with 30 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:36:22:077, 2025-01-13 20:36:23:269, 1096.6787, 920.0325, 100000, 83892.6174, 142, 1050, 1044.4559, 95238.0952

Testing scalability: 20 producers, 30 consumers, 1048575B message size.
Running producer test with 20 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 365.898280 records/sec (365.90 MB/sec), 1.98 ms avg latency, 131.00 ms max latency, 2 ms 50th, 4 ms 95th, 10 ms 99th, 131 ms 99.9th.

Running consumer test with 30 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:36:28:218, 2025-01-13 20:36:28:384, 0.9766, 5.8829, 1000, 6024.0964, 144, 22, 44.3892, 45454.5455

Testing scalability: 20 producers, 40 consumers, 1024B message size.
Running producer test with 20 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99403.578529 records/sec (97.07 MB/sec), 42.14 ms avg latency, 133.00 ms max latency, 40 ms 50th, 97 ms 95th, 100 ms 99th, 101 ms 99.9th.

Running consumer test with 40 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:36:31:588, 2025-01-13 20:36:32:828, 1096.6787, 884.4183, 100000, 80645.1613, 141, 1099, 997.8878, 90991.8107

Testing scalability: 20 producers, 40 consumers, 1048575B message size.
Running producer test with 20 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 362.187613 records/sec (362.19 MB/sec), 2.64 ms avg latency, 132.00 ms max latency, 2 ms 50th, 5 ms 95th, 28 ms 99th, 132 ms 99.9th.

Running consumer test with 40 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:36:37:837, 2025-01-13 20:36:38:004, 0.9766, 5.8477, 1000, 5988.0240, 146, 21, 46.5030, 47619.0476

Testing scalability: 20 producers, 50 consumers, 1024B message size.
Running producer test with 20 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99304.865938 records/sec (96.98 MB/sec), 37.09 ms avg latency, 136.00 ms max latency, 4 ms 50th, 105 ms 95th, 109 ms 99th, 112 ms 99.9th.

Running consumer test with 50 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:36:41:528, 2025-01-13 20:36:43:883, 1096.6787, 465.6810, 100000, 42462.8450, 784, 1571, 698.0769, 63653.7237

Testing scalability: 20 producers, 50 consumers, 1048575B message size.
Running producer test with 20 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 306.372549 records/sec (306.37 MB/sec), 4.10 ms avg latency, 161.00 ms max latency, 2 ms 50th, 12 ms 95th, 37 ms 99th, 161 ms 99.9th.

Running consumer test with 50 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:36:49:834, 2025-01-13 20:36:50:049, 0.9766, 4.5422, 1000, 4651.1628, 185, 30, 32.5521, 33333.3333

Testing scalability: 30 producers, 10 consumers, 1024B message size.
Running producer test with 30 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 87719.298246 records/sec (85.66 MB/sec), 170.66 ms avg latency, 229.00 ms max latency, 180 ms 50th, 223 ms 95th, 227 ms 99th, 228 ms 99.9th.

Running consumer test with 10 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:36:53:638, 2025-01-13 20:36:55:089, 1096.6787, 755.8089, 100000, 68917.9876, 164, 1287, 852.1202, 77700.0777

Testing scalability: 30 producers, 10 consumers, 1048575B message size.
Running producer test with 30 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 394.944708 records/sec (394.94 MB/sec), 4.18 ms avg latency, 146.00 ms max latency, 2 ms 50th, 22 ms 95th, 31 ms 99th, 146 ms 99.9th.

Running consumer test with 10 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:36:59:832, 2025-01-13 20:36:59:997, 0.9766, 5.9186, 1000, 6060.6061, 143, 22, 44.3892, 45454.5455

Testing scalability: 30 producers, 20 consumers, 1024B message size.
Running producer test with 30 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99403.578529 records/sec (97.07 MB/sec), 54.27 ms avg latency, 141.00 ms max latency, 44 ms 50th, 135 ms 95th, 139 ms 99th, 141 ms 99.9th.

Running consumer test with 20 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:37:03:214, 2025-01-13 20:37:04:435, 1096.6787, 898.1808, 100000, 81900.0819, 141, 1080, 1015.4433, 92592.5926

Testing scalability: 30 producers, 20 consumers, 1048575B message size.
Running producer test with 30 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 361.925443 records/sec (361.93 MB/sec), 2.23 ms avg latency, 129.00 ms max latency, 2 ms 50th, 5 ms 95th, 13 ms 99th, 129 ms 99.9th.

Running consumer test with 20 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:37:09:420, 2025-01-13 20:37:09:597, 0.9766, 5.5173, 1000, 5649.7175, 150, 27, 36.1690, 37037.0370

Testing scalability: 30 producers, 30 consumers, 1024B message size.
Running producer test with 30 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99403.578529 records/sec (97.07 MB/sec), 38.86 ms avg latency, 145.00 ms max latency, 8 ms 50th, 104 ms 95th, 105 ms 99th, 105 ms 99.9th.

Running consumer test with 30 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:37:12:817, 2025-01-13 20:37:14:047, 1096.6787, 891.6087, 100000, 81300.8130, 144, 1086, 1009.8331, 92081.0313

Testing scalability: 30 producers, 30 consumers, 1048575B message size.
Running producer test with 30 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 360.880549 records/sec (360.88 MB/sec), 2.81 ms avg latency, 128.00 ms max latency, 2 ms 50th, 7 ms 95th, 30 ms 99th, 128 ms 99.9th.

Running consumer test with 30 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:37:19:006, 2025-01-13 20:37:19:172, 0.9766, 5.8829, 1000, 6024.0964, 145, 21, 46.5030, 47619.0476

Testing scalability: 30 producers, 40 consumers, 1024B message size.
Running producer test with 30 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99304.865938 records/sec (96.98 MB/sec), 57.12 ms avg latency, 140.00 ms max latency, 62 ms 50th, 113 ms 95th, 117 ms 99th, 117 ms 99.9th.

Running consumer test with 40 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:37:22:386, 2025-01-13 20:37:23:592, 1096.6787, 909.3522, 100000, 82918.7396, 143, 1063, 1031.6827, 94073.3772

Testing scalability: 30 producers, 40 consumers, 1048575B message size.
Running producer test with 30 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 359.971202 records/sec (359.97 MB/sec), 6.54 ms avg latency, 134.00 ms max latency, 4 ms 50th, 20 ms 95th, 29 ms 99th, 134 ms 99.9th.

Running consumer test with 40 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:37:28:587, 2025-01-13 20:37:28:754, 0.9766, 5.8477, 1000, 5988.0240, 145, 22, 44.3892, 45454.5455

Testing scalability: 30 producers, 50 consumers, 1024B message size.
Running producer test with 30 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 98814.229249 records/sec (96.50 MB/sec), 44.89 ms avg latency, 139.00 ms max latency, 31 ms 50th, 100 ms 95th, 106 ms 99th, 111 ms 99.9th.

Running consumer test with 50 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:37:32:048, 2025-01-13 20:37:33:268, 1096.6787, 898.9170, 100000, 81967.2131, 143, 1077, 1018.2718, 92850.5107

Testing scalability: 30 producers, 50 consumers, 1048575B message size.
Running producer test with 30 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 357.781753 records/sec (357.78 MB/sec), 7.52 ms avg latency, 130.00 ms max latency, 4 ms 50th, 24 ms 95th, 47 ms 99th, 130 ms 99.9th.

Running consumer test with 50 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:37:38:278, 2025-01-13 20:37:38:449, 0.9766, 5.7109, 1000, 5847.9532, 148, 23, 42.4592, 43478.2609

Testing scalability: 40 producers, 10 consumers, 1024B message size.
Running producer test with 40 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99206.349206 records/sec (96.88 MB/sec), 41.47 ms avg latency, 137.00 ms max latency, 23 ms 50th, 101 ms 95th, 110 ms 99th, 116 ms 99.9th.

Running consumer test with 10 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:37:41:678, 2025-01-13 20:37:42:930, 1096.6787, 875.9415, 100000, 79872.2045, 145, 1107, 990.6764, 90334.2367

Testing scalability: 40 producers, 10 consumers, 1048575B message size.
Running producer test with 40 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 358.551452 records/sec (358.55 MB/sec), 4.98 ms avg latency, 130.00 ms max latency, 2 ms 50th, 21 ms 95th, 29 ms 99th, 130 ms 99.9th.

Running consumer test with 10 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:37:48:035, 2025-01-13 20:37:48:401, 0.9766, 2.6682, 1000, 2732.2404, 337, 29, 33.6746, 34482.7586

Testing scalability: 40 producers, 20 consumers, 1024B message size.
Running producer test with 40 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99304.865938 records/sec (96.98 MB/sec), 33.88 ms avg latency, 139.00 ms max latency, 2 ms 50th, 99 ms 95th, 101 ms 99th, 102 ms 99.9th.

Running consumer test with 20 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:37:51:624, 2025-01-13 20:37:52:820, 1096.6787, 916.9555, 100000, 83612.0401, 142, 1054, 1040.4922, 94876.6603

Testing scalability: 40 producers, 20 consumers, 1048575B message size.
Running producer test with 40 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 362.976407 records/sec (362.98 MB/sec), 2.33 ms avg latency, 131.00 ms max latency, 1 ms 50th, 5 ms 95th, 21 ms 99th, 131 ms 99.9th.

Running consumer test with 20 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:37:57:789, 2025-01-13 20:37:57:955, 0.9766, 5.8829, 1000, 6024.0964, 145, 21, 46.5030, 47619.0476

Testing scalability: 40 producers, 30 consumers, 1024B message size.
Running producer test with 40 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99304.865938 records/sec (96.98 MB/sec), 33.56 ms avg latency, 138.00 ms max latency, 2 ms 50th, 98 ms 95th, 101 ms 99th, 103 ms 99.9th.

Running consumer test with 30 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:38:01:203, 2025-01-13 20:38:02:366, 1096.6787, 942.9740, 100000, 85984.5228, 147, 1016, 1079.4082, 98425.1969

Testing scalability: 40 producers, 30 consumers, 1048575B message size.
Running producer test with 40 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 399.680256 records/sec (399.68 MB/sec), 2.47 ms avg latency, 136.00 ms max latency, 2 ms 50th, 6 ms 95th, 17 ms 99th, 136 ms 99.9th.

Running consumer test with 30 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:38:07:092, 2025-01-13 20:38:07:256, 0.9766, 5.9546, 1000, 6097.5610, 142, 22, 44.3892, 45454.5455

Testing scalability: 40 producers, 40 consumers, 1024B message size.
Running producer test with 40 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99403.578529 records/sec (97.07 MB/sec), 45.29 ms avg latency, 135.00 ms max latency, 44 ms 50th, 112 ms 95th, 115 ms 99th, 116 ms 99.9th.

Running consumer test with 40 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:38:10:451, 2025-01-13 20:38:11:630, 1096.6787, 930.1770, 100000, 84817.6421, 141, 1038, 1056.5306, 96339.1137

Testing scalability: 40 producers, 40 consumers, 1048575B message size.
Running producer test with 40 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 363.768643 records/sec (363.77 MB/sec), 2.17 ms avg latency, 131.00 ms max latency, 2 ms 50th, 5 ms 95th, 11 ms 99th, 131 ms 99.9th.

Running consumer test with 40 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:38:16:691, 2025-01-13 20:38:16:858, 0.9766, 5.8477, 1000, 5988.0240, 146, 21, 46.5030, 47619.0476

Testing scalability: 40 producers, 50 consumers, 1024B message size.
Running producer test with 40 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99403.578529 records/sec (97.07 MB/sec), 34.54 ms avg latency, 138.00 ms max latency, 3 ms 50th, 100 ms 95th, 101 ms 99th, 102 ms 99.9th.

Running consumer test with 50 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:38:20:053, 2025-01-13 20:38:21:210, 1096.6787, 947.8641, 100000, 86430.4235, 144, 1013, 1082.6049, 98716.6831

Testing scalability: 40 producers, 50 consumers, 1048575B message size.
Running producer test with 40 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 358.808755 records/sec (358.81 MB/sec), 2.02 ms avg latency, 132.00 ms max latency, 1 ms 50th, 5 ms 95th, 11 ms 99th, 132 ms 99.9th.

Running consumer test with 50 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:38:26:214, 2025-01-13 20:38:26:382, 0.9766, 5.8129, 1000, 5952.3810, 147, 21, 46.5030, 47619.0476

Testing scalability: 50 producers, 10 consumers, 1024B message size.
Running producer test with 50 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99009.900990 records/sec (96.69 MB/sec), 36.81 ms avg latency, 140.00 ms max latency, 25 ms 50th, 89 ms 95th, 92 ms 99th, 93 ms 99.9th.

Running consumer test with 10 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:38:29:626, 2025-01-13 20:38:30:832, 1096.6787, 909.3522, 100000, 82918.7396, 143, 1063, 1031.6827, 94073.3772

Testing scalability: 50 producers, 10 consumers, 1048575B message size.
Running producer test with 50 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 364.963504 records/sec (364.96 MB/sec), 2.03 ms avg latency, 131.00 ms max latency, 1 ms 50th, 4 ms 95th, 14 ms 99th, 131 ms 99.9th.

Running consumer test with 10 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:38:35:909, 2025-01-13 20:38:36:086, 0.9766, 5.5173, 1000, 5649.7175, 153, 24, 40.6901, 41666.6667

Testing scalability: 50 producers, 20 consumers, 1024B message size.
Running producer test with 50 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99304.865938 records/sec (96.98 MB/sec), 34.04 ms avg latency, 137.00 ms max latency, 1 ms 50th, 103 ms 95th, 106 ms 99th, 107 ms 99.9th.

Running consumer test with 20 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:38:39:291, 2025-01-13 20:38:40:454, 1096.6787, 942.9740, 100000, 85984.5228, 141, 1022, 1073.0712, 97847.3581

Testing scalability: 50 producers, 20 consumers, 1048575B message size.
Running producer test with 50 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 363.240102 records/sec (363.24 MB/sec), 1.93 ms avg latency, 128.00 ms max latency, 1 ms 50th, 4 ms 95th, 9 ms 99th, 128 ms 99.9th.

Running consumer test with 20 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:38:45:429, 2025-01-13 20:38:45:597, 0.9766, 5.8129, 1000, 5952.3810, 146, 22, 44.3892, 45454.5455

Testing scalability: 50 producers, 30 consumers, 1024B message size.
Running producer test with 50 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99502.487562 records/sec (97.17 MB/sec), 33.64 ms avg latency, 137.00 ms max latency, 4 ms 50th, 90 ms 95th, 94 ms 99th, 95 ms 99.9th.

Running consumer test with 30 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:38:48:802, 2025-01-13 20:38:49:913, 1096.6787, 987.1096, 100000, 90009.0009, 141, 970, 1130.5966, 103092.7835

Testing scalability: 50 producers, 30 consumers, 1048575B message size.
Running producer test with 50 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 364.431487 records/sec (364.43 MB/sec), 1.98 ms avg latency, 129.00 ms max latency, 1 ms 50th, 4 ms 95th, 9 ms 99th, 129 ms 99.9th.

Running consumer test with 30 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:38:54:830, 2025-01-13 20:38:55:002, 0.9766, 5.6777, 1000, 5813.9535, 150, 22, 44.3892, 45454.5455

Testing scalability: 50 producers, 40 consumers, 1024B message size.
Running producer test with 50 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99304.865938 records/sec (96.98 MB/sec), 32.71 ms avg latency, 135.00 ms max latency, 2 ms 50th, 93 ms 95th, 94 ms 99th, 94 ms 99.9th.

Running consumer test with 40 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:38:58:190, 2025-01-13 20:38:59:312, 1096.6787, 977.4320, 100000, 89126.5597, 141, 981, 1117.9192, 101936.7992

Testing scalability: 50 producers, 40 consumers, 1048575B message size.
Running producer test with 50 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 363.372093 records/sec (363.37 MB/sec), 2.02 ms avg latency, 140.00 ms max latency, 1 ms 50th, 4 ms 95th, 9 ms 99th, 140 ms 99.9th.

Running consumer test with 40 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:39:04:363, 2025-01-13 20:39:04:530, 0.9766, 5.8477, 1000, 5988.0240, 144, 23, 42.4592, 43478.2609

Testing scalability: 50 producers, 50 consumers, 1024B message size.
Running producer test with 50 producers, 1024B message size...
Producer test completed successfully.
100000 records sent, 99304.865938 records/sec (96.98 MB/sec), 35.84 ms avg latency, 146.00 ms max latency, 3 ms 50th, 102 ms 95th, 103 ms 99th, 104 ms 99.9th.

Running consumer test with 50 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:39:07:735, 2025-01-13 20:39:08:907, 1096.6787, 935.7327, 100000, 85324.2321, 140, 1032, 1062.6732, 96899.2248

Testing scalability: 50 producers, 50 consumers, 1048575B message size.
Running producer test with 50 producers, 1048575B message size...
Producer test completed successfully.
1000 records sent, 361.402241 records/sec (361.40 MB/sec), 1.85 ms avg latency, 131.00 ms max latency, 2 ms 50th, 4 ms 95th, 5 ms 99th, 131 ms 99.9th.

Running consumer test with 50 consumers...
Consumer test completed successfully.
start.time, end.time, data.consumed.in.MB, MB.sec, data.consumed.in.nMsg, nMsg.sec, rebalance.time.ms, fetch.time.ms, fetch.MB.sec, fetch.nMsg.sec
2025-01-13 20:39:13:911, 2025-01-13 20:39:14:082, 0.9766, 5.7109, 1000, 5847.9532, 148, 23, 42.4592, 43478.2609